MCUdude/TinyCore/avr/boards.txt
x5.menu.clock.20MHz_external=20 MHz external osc.
x5.menu.clock.20MHz_external.bootloader.clock=20MHz
x5.menu.clock.20MHz_external.bootloader.osc=x
x5.menu.clock.20MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.20MHz_external.bootloader.baudrate=115200
x5.menu.clock.20MHz_external.build.clocksource=1
x5.menu.clock.20MHz_external.build.f_cpu=20000000L

x5.menu.clock.18_432MHz_external=18.432 MHz external osc.
x5.menu.clock.18_432MHz_external.bootloader.clock=18.432MHz
x5.menu.clock.18_432MHz_external.bootloader.osc=x
x5.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.18_432MHz_external.bootloader.baudrate=115200
x5.menu.clock.18_432MHz_external.build.clocksource=1
x5.menu.clock.18_432MHz_external.build.f_cpu=18432000L

x5.menu.clock.16MHz_external=16 MHz external osc.
x5.menu.clock.16MHz_external.bootloader.clock=16MHz
x5.menu.clock.16MHz_external.bootloader.osc=x
x5.menu.clock.16MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.16MHz_external.bootloader.baudrate=115200
x5.menu.clock.16MHz_external.build.clocksource=1
x5.menu.clock.16MHz_external.build.f_cpu=16000000L

x5.menu.clock.14_7456MHz_external=14.7456 MHz external osc.
x5.menu.clock.14_7456MHz_external.bootloader.clock=14.7456MHz
x5.menu.clock.14_7456MHz_external.bootloader.osc=x
x5.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.14_7456MHz_external.bootloader.baudrate=115200
x5.menu.clock.14_7456MHz_external.build.clocksource=1
x5.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

x5.menu.clock.12MHz_external=12 MHz external osc.
x5.menu.clock.12MHz_external.bootloader.clock=12MHz
x5.menu.clock.12MHz_external.bootloader.osc=x
x5.menu.clock.12MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.12MHz_external.bootloader.baudrate=115200
x5.menu.clock.12MHz_external.build.clocksource=1
x5.menu.clock.12MHz_external.build.f_cpu=16000000L

x5.menu.clock.11_0592MHz_external=11.7456 MHz external osc.
x5.menu.clock.11_0592MHz_external.bootloader.clock=11.0592MHz
x5.menu.clock.11_0592MHz_external.bootloader.osc=x
x5.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.11_0592MHz_external.bootloader.baudrate=115200
x5.menu.clock.11_0592MHz_external.build.clocksource=1
x5.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

x5.menu.clock.9_216MHz_external=9.216 MHz external osc.
x5.menu.clock.9_216MHz_external.bootloader.clock=9.216MHz
x5.menu.clock.9_216MHz_external.bootloader.osc=x
x5.menu.clock.9_216MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.9_216MHz_external.bootloader.baudrate=115200
x5.menu.clock.9_216MHz_external.build.clocksource=1
x5.menu.clock.9_216MHz_external.build.f_cpu=9216000L

x5.menu.clock.8MHz_external=8 MHz external osc.
x5.menu.clock.8MHz_external.bootloader.clock=8MHz
x5.menu.clock.8MHz_external.bootloader.osc=x
x5.menu.clock.8MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.8MHz_external.bootloader.baudrate=38400
x5.menu.clock.8MHz_external.build.clocksource=1
x5.menu.clock.8MHz_external.build.f_cpu=8000000L

x5.menu.clock.7_372MHz_external=7.372 MHz external osc.
x5.menu.clock.7_372MHz_external.bootloader.clock=7.372MHz
x5.menu.clock.7_372MHz_external.bootloader.osc=x
x5.menu.clock.7_372MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.7_372MHz_external.bootloader.baudrate=115200
x5.menu.clock.7_372MHz_external.build.clocksource=1
x5.menu.clock.7_372MHz_external.build.f_cpu=9216000L

x5.menu.clock.6MHz_external=6 MHz external osc.
x5.menu.clock.6MHz_external.bootloader.clock=6MHz
x5.menu.clock.6MHz_external.bootloader.osc=x
x5.menu.clock.6MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.6MHz_external.bootloader.baudrate=57600
x5.menu.clock.6MHz_external.build.clocksource=1
x5.menu.clock.6MHz_external.build.f_cpu=6000000L

x5.menu.clock.4MHz_external=4 MHz external osc.
x5.menu.clock.4MHz_external.bootloader.clock=4MHz
x5.menu.clock.4MHz_external.bootloader.osc=x
x5.menu.clock.4MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.4MHz_external.bootloader.baudrate=57600
x5.menu.clock.4MHz_external.build.clocksource=1
x5.menu.clock.4MHz_external.build.f_cpu=4000000L

x5.menu.clock.1MHz_external=1 MHz external osc.
x5.menu.clock.1MHz_external.bootloader.clock=1MHz
x5.menu.clock.1MHz_external.bootloader.osc=x
x5.menu.clock.1MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.1MHz_external.bootloader.baudrate=9600
x5.menu.clock.1MHz_external.build.clocksource=1
x5.menu.clock.1MHz_external.build.f_cpu=1000000L


########################
#### ATtiny24/44/84 ####
########################

# General
x4.name=ATtiny24/44/84
x4.upload.tool=avrdude
x4.upload.speed={bootloader.baudrate}
x4.bootloader.tool=avrdude
x4.bootloader.unlock_bits=0xff
x4.bootloader.lock_bits=0xff
x4.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
x4.bootloader.pins=swio_rxa2_txa1
x4.build.core=tiny
x4.build.variant=tinyX4
x4.build.board=AVR_ATTINYX4
x4.build.extra_flags={build.pllsettings}
x4.build.pllsettings=

# Upload port select / Bootloader
x4.menu.bootloader.no_bootloader=No bootloader
x4.menu.bootloader.no_bootloader.build.export_merged_output=false
x4.menu.bootloader.no_bootloader.bootloader.str=
x4.menu.bootloader.no_bootloader.bootloader.extended_fuses=0xff

x4.menu.bootloader.urboot=Yes
x4.menu.bootloader.urboot.build.export_merged_output=true
x4.menu.bootloader.urboot.bootloader.str=-Uurboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_{bootloader.osc}{bootloader.clock}
x4.menu.bootloader.urboot.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_-125=Yes (F_CPU -1.25%)
x4.menu.bootloader.urboot_-125.build.export_merged_output=true
x4.menu.bootloader.urboot_-125.bootloader.str=-U urboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_h{bootloader.clock}
x4.menu.bootloader.urboot_-125.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_-250=Yes (F_CPU -2.50%)
x4.menu.bootloader.urboot_-250.build.export_merged_output=true
x4.menu.bootloader.urboot_-250.bootloader.str=-U urboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_g{bootloader.clock}
x4.menu.bootloader.urboot_-250.bootloader.extended_fuses=0xfe

