MCUdude/TinyCore/avr/boards.txt
x4.menu.bootloader.urboot_-375=Yes (F_CPU -3.75%)
x4.menu.bootloader.urboot_-375.build.export_merged_output=true
x4.menu.bootloader.urboot_-375.bootloader.str=-U urboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_f{bootloader.clock}
x4.menu.bootloader.urboot_-375.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_-500=Yes (F_CPU -5.00%)
x4.menu.bootloader.urboot_-500.build.export_merged_output=true
x4.menu.bootloader.urboot_-500.bootloader.str=-U urboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_e{bootloader.clock}
x4.menu.bootloader.urboot_-500.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_+125=Yes (F_CPU +1.25%)
x4.menu.bootloader.urboot_+125.build.export_merged_output=true
x4.menu.bootloader.urboot_+125.bootloader.str=-U urboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_j{bootloader.clock}
x4.menu.bootloader.urboot_+125.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_+250=Yes (F_CPU +2.50%)
x4.menu.bootloader.urboot_+250.build.export_merged_output=true
x4.menu.bootloader.urboot_+250.bootloader.str=-U urboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_k{bootloader.clock}
x4.menu.bootloader.urboot_+250.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_+375=Yes (F_CPU +3.75%)
x4.menu.bootloader.urboot_+375.build.export_merged_output=true
x4.menu.bootloader.urboot_+375.bootloader.str=-U urboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_l{bootloader.clock}
x4.menu.bootloader.urboot_+375.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_+500=Yes (F_CPU +5.00%)
x4.menu.bootloader.urboot_+500.build.export_merged_output=true
x4.menu.bootloader.urboot_+500.bootloader.str=-U urboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_m{bootloader.clock}
x4.menu.bootloader.urboot_+500.bootloader.extended_fuses=0xfe

# EEPROM
x4.menu.eeprom.keep=EEPROM retained
x4.menu.eeprom.keep.bootloader.eesave_bit=0
x4.menu.eeprom.erase=EEPROM not retained
x4.menu.eeprom.erase.bootloader.eesave_bit=1

# Chip variants
x4.menu.chip.85=ATtiny84
x4.menu.chip.85.build.mcu=attiny84
x4.menu.chip.85.upload.maximum_size=8192
x4.menu.chip.85.upload.maximum_data_size=512

x4.menu.chip.45=ATtiny44
x4.menu.chip.45.build.mcu=attiny44
x4.menu.chip.45.upload.maximum_size=4096
x4.menu.chip.45.upload.maximum_data_size=256

x4.menu.chip.25=ATtiny24
x4.menu.chip.25.build.mcu=attiny25
x4.menu.chip.25.upload.maximum_size=2048
x4.menu.chip.25.upload.maximum_data_size=128

# Brown out detection
x4.menu.bod.2v7=BOD 2.7V
x4.menu.bod.2v7.bootloader.bod_bits=101
x4.menu.bod.4v3=BOD 4.3V
x4.menu.bod.4v3.bootloader.bod_bits=100
x4.menu.bod.1v8=BOD 1.8V
x4.menu.bod.1v8.bootloader.bod_bits=110
x4.menu.bod.disable=BOD disabled
x4.menu.bod.disable.bootloader.bod_bits=111

# Clock frequencies
x4.menu.clock.8MHz_internal=8 MHz internal osc.
x4.menu.clock.8MHz_internal.bootloader.clock=8MHz
x4.menu.clock.8MHz_internal.bootloader.osc=i
x4.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
x4.menu.clock.8MHz_internal.bootloader.baudrate=38400
x4.menu.clock.8MHz_internal.build.clocksource=0
x4.menu.clock.8MHz_internal.build.f_cpu=8000000L

x4.menu.clock.16MHz_internal_PLL=16 MHz internal PLL osc.
x4.menu.clock.16MHz_internal_PLL.bootloader.clock=16MHz
x4.menu.clock.16MHz_internal_PLL.bootloader.osc=i
x4.menu.clock.16MHz_internal_PLL.bootloader.low_fuses=0xf1
x4.menu.clock.16MHz_internal_PLL.bootloader.baudrate=57600
x4.menu.clock.16MHz_internal_PLL.build.clocksource=6
x4.menu.clock.16MHz_internal_PLL.build.f_cpu=16000000L

x4.menu.clock.4MHz_internal=4 MHz internal osc.
x4.menu.clock.4MHz_internal.bootloader.clock=4MHz
x4.menu.clock.4MHz_internal.bootloader.osc=i
x4.menu.clock.4MHz_internal.bootloader.low_fuses=0x62
x4.menu.clock.4MHz_internal.bootloader.baudrate=9600
x4.menu.clock.4MHz_internal.build.clocksource=0
x4.menu.clock.4MHz_internal.build.f_cpu=4000000L

x4.menu.clock.1MHz_internal=1 MHz internal osc.
x4.menu.clock.1MHz_internal.bootloader.clock=1MHz
x4.menu.clock.1MHz_internal.bootloader.osc=i
x4.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
x4.menu.clock.1MHz_internal.bootloader.baudrate=9600
x4.menu.clock.1MHz_internal.build.clocksource=0
x4.menu.clock.1MHz_internal.build.f_cpu=1000000L

x4.menu.clock.128kHz_external=128 kHz internal osc.
x4.menu.clock.128kHz_external.bootloader.clock=128kHz
x4.menu.clock.128kHz_external.bootloader.osc=i
x4.menu.clock.128kHz_external.bootloader.low_fuses=0xc4
x4.menu.clock.128kHz_external.bootloader.baudrate=1200
x4.menu.clock.128kHz_external.build.clocksource=3
x4.menu.clock.128kHz_external.build.f_cpu=128000L

x4.menu.clock.20MHz_external=20 MHz external osc.
x4.menu.clock.20MHz_external.bootloader.clock=20MHz
x4.menu.clock.20MHz_external.bootloader.osc=x
x4.menu.clock.20MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.20MHz_external.bootloader.baudrate=115200
x4.menu.clock.20MHz_external.build.clocksource=1
x4.menu.clock.20MHz_external.build.f_cpu=20000000L

x4.menu.clock.18_432MHz_external=18.432 MHz external osc.
x4.menu.clock.18_432MHz_external.bootloader.clock=18.432MHz
x4.menu.clock.18_432MHz_external.bootloader.osc=x
x4.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.18_432MHz_external.bootloader.baudrate=115200
x4.menu.clock.18_432MHz_external.build.clocksource=1
x4.menu.clock.18_432MHz_external.build.f_cpu=18432000L

x4.menu.clock.16MHz_external=16 MHz external osc.
x4.menu.clock.16MHz_external.bootloader.clock=16MHz
x4.menu.clock.16MHz_external.bootloader.osc=x
x4.menu.clock.16MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.16MHz_external.bootloader.baudrate=115200
x4.menu.clock.16MHz_external.build.clocksource=1
x4.menu.clock.16MHz_external.build.f_cpu=16000000L

x4.menu.clock.14_7456MHz_external=14.7456 MHz external osc.
x4.menu.clock.14_7456MHz_external.bootloader.clock=14.7456MHz
x4.menu.clock.14_7456MHz_external.bootloader.osc=x
x4.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.14_7456MHz_external.bootloader.baudrate=115200
x4.menu.clock.14_7456MHz_external.build.clocksource=1
x4.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

x4.menu.clock.12MHz_external=12 MHz external osc.
x4.menu.clock.12MHz_external.bootloader.clock=12MHz
x4.menu.clock.12MHz_external.bootloader.osc=x
x4.menu.clock.12MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.12MHz_external.bootloader.baudrate=115200
x4.menu.clock.12MHz_external.build.clocksource=1
x4.menu.clock.12MHz_external.build.f_cpu=16000000L

x4.menu.clock.11_0592MHz_external=11.7456 MHz external osc.
x4.menu.clock.11_0592MHz_external.bootloader.clock=11.0592MHz
x4.menu.clock.11_0592MHz_external.bootloader.osc=x
x4.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.11_0592MHz_external.bootloader.baudrate=115200
x4.menu.clock.11_0592MHz_external.build.clocksource=1
x4.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

x4.menu.clock.9_216MHz_external=9.216 MHz external osc.
x4.menu.clock.9_216MHz_external.bootloader.clock=9.216MHz
x4.menu.clock.9_216MHz_external.bootloader.osc=x
x4.menu.clock.9_216MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.9_216MHz_external.bootloader.baudrate=115200
x4.menu.clock.9_216MHz_external.build.clocksource=1
x4.menu.clock.9_216MHz_external.build.f_cpu=9216000L

x4.menu.clock.8MHz_external=8 MHz external osc.
x4.menu.clock.8MHz_external.bootloader.clock=8MHz
x4.menu.clock.8MHz_external.bootloader.osc=x
x4.menu.clock.8MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.8MHz_external.bootloader.baudrate=38400
x4.menu.clock.8MHz_external.build.clocksource=1
x4.menu.clock.8MHz_external.build.f_cpu=8000000L

x4.menu.clock.7_372MHz_external=7.372 MHz external osc.
x4.menu.clock.7_372MHz_external.bootloader.clock=7.372MHz
x4.menu.clock.7_372MHz_external.bootloader.osc=x
x4.menu.clock.7_372MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.7_372MHz_external.bootloader.baudrate=115200
x4.menu.clock.7_372MHz_external.build.clocksource=1
x4.menu.clock.7_372MHz_external.build.f_cpu=9216000L

x4.menu.clock.6MHz_external=6 MHz external osc.
x4.menu.clock.6MHz_external.bootloader.clock=6MHz
x4.menu.clock.6MHz_external.bootloader.osc=x
x4.menu.clock.6MHz_external.bootloader.low_fuses=0xff
x4.menu.clock.6MHz_external.bootloader.baudrate=57600
x4.menu.clock.6MHz_external.build.clocksource=1
x4.menu.clock.6MHz_external.build.f_cpu=6000000L

